//----------------------------------------------------------------------------//
// Файл Complex.h                                                             //
//                                                                            //
//                        *** ТИП КОМПЛЕКСНОЕ ЧИСЛО ***                       //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей                                                      //
//                                                                            //
//                                                           Москва, 2022 год //
//----------------------------------------------------------------------------//


#ifndef COMPLEXH
#define COMPLEXH

#include <complex>
#include <vector>


//Тип описывает комплексное число
typedef std::complex<double> TComplex;

//Тип описывает массив комплексных чисел
typedef std::vector<TComplex> TArrComplex;


#endif
